In [6]:
import pandas as pd

In [7]:
data = {

    'Nombre': ['Juan', 'María', 'Pedro', 'Ana', 'Luis'],

    'Edad': [25, 32, None, 42, 28],

    'Fecha': ['31/01/2020', '31/01/2020', None, '31/01/2020', '01/31/2020'],

    'Género': ['M', 'F', None, 'F', 'M'],

    'Ciudad': ['Madrid', None, 'Madrid', 'Valencia', 'Barcelona'],

    'Altura': [175, 163, 180, 158, 170],

    'Peso': [70, None, 80, 60, 75],

    'Ingresos': [50000, 60000, 40000, None, 55000]

}

In [8]:
df=pd.DataFrame(data)
df

  Nombre  Edad       Fecha Género     Ciudad  Altura  Peso  Ingresos
0   Juan  25.0  31/01/2020      M     Madrid     175  70.0   50000.0
1  María  32.0  31/01/2020      F       None     163   NaN   60000.0
2  Pedro   NaN        None   None     Madrid     180  80.0   40000.0
3    Ana  42.0  31/01/2020      F   Valencia     158  60.0       NaN
4   Luis  28.0  01/31/2020      M  Barcelona     170  75.0   55000.0

crear un dataframe con copia de los datos que no estan vacios

In [87]:
dfcopia=df.dropna()
print(dfcopia)

  Nombre  Edad       Fecha Género     Ciudad  Altura  Peso  Ingresos
0   Juan  25.0  31/01/2020      M     Madrid     175  70.0   50000.0
4   Luis  28.0  01/31/2020      M  Barcelona     170  75.0   55000.0

In [88]:
df

  Nombre  Edad       Fecha Género     Ciudad  Altura  Peso  Ingresos
0   Juan  25.0  31/01/2020      M     Madrid     175  70.0   50000.0
1  María  32.0  31/01/2020      F       None     163   NaN   60000.0
2  Pedro   NaN        None   None     Madrid     180  80.0   40000.0
3    Ana  42.0  31/01/2020      F   Valencia     158  60.0       NaN
4   Luis  28.0  01/31/2020      M  Barcelona     170  75.0   55000.0

crear copia de los datos originales y rellenar los espacios de los ingresos vacios con cero

In [9]:
df_sinnulos=df
#df_sinnulos["Ingresos"].fillna(0, inplace=True)
df

  Nombre  Edad       Fecha Género     Ciudad  Altura  Peso  Ingresos
0   Juan  25.0  31/01/2020      M     Madrid     175  70.0   50000.0
1  María  32.0  31/01/2020      F       None     163   NaN   60000.0
2  Pedro   NaN        None   None     Madrid     180  80.0   40000.0
3    Ana  42.0  31/01/2020      F   Valencia     158  60.0       NaN
4   Luis  28.0  01/31/2020      M  Barcelona     170  75.0   55000.0

crear copia de los datos originales y rellenar los espacios de acuerdo al nombre el genero

In [10]:
gen=df_sinnulos["Género"].isna()
filtro=df_sinnulos[gen]
filtro

  Nombre  Edad Fecha Género  Ciudad  Altura  Peso  Ingresos
2  Pedro   NaN  None   None  Madrid     180  80.0   40000.0

In [11]:
df_sinnulos["Género"].fillna("M", inplace=True)
df

  Nombre  Edad       Fecha Género     Ciudad  Altura  Peso  Ingresos
0   Juan  25.0  31/01/2020      M     Madrid     175  70.0   50000.0
1  María  32.0  31/01/2020      F       None     163   NaN   60000.0
2  Pedro   NaN        None      M     Madrid     180  80.0   40000.0
3    Ana  42.0  31/01/2020      F   Valencia     158  60.0       NaN
4   Luis  28.0  01/31/2020      M  Barcelona     170  75.0   55000.0

In [12]:
pesomedio=df_sinnulos["Peso"].mean()
df_sinnulos["Peso"].fillna(pesomedio, inplace=True)
df

  Nombre  Edad       Fecha Género     Ciudad  Altura   Peso  Ingresos
0   Juan  25.0  31/01/2020      M     Madrid     175  70.00   50000.0
1  María  32.0  31/01/2020      F       None     163  71.25   60000.0
2  Pedro   NaN        None      M     Madrid     180  80.00   40000.0
3    Ana  42.0  31/01/2020      F   Valencia     158  60.00       NaN
4   Luis  28.0  01/31/2020      M  Barcelona     170  75.00   55000.0

In [13]:
df_sinnulos["Ciudad"].fillna("Madrid", inplace=True)
df_sinnulos["Fecha"].fillna("31/01/2020", inplace=True)
edadmedio=df_sinnulos["Edad"].median()
df_sinnulos["Edad"].fillna(edadmedio, inplace=True)
ingresomedio=df_sinnulos["Ingresos"].mean()
df_sinnulos["Ingresos"].fillna(ingresomedio, inplace=True)
df

  Nombre  Edad       Fecha Género     Ciudad  Altura   Peso  Ingresos
0   Juan  25.0  31/01/2020      M     Madrid     175  70.00   50000.0
1  María  32.0  31/01/2020      F     Madrid     163  71.25   60000.0
2  Pedro  30.0  31/01/2020      M     Madrid     180  80.00   40000.0
3    Ana  42.0  31/01/2020      F   Valencia     158  60.00   51250.0
4   Luis  28.0  01/31/2020      M  Barcelona     170  75.00   55000.0